zephyrproject-rtos/zephyr/soc/st/stm32/stm32wbax/hci_if/sys_wireless_plat.c
/*
 * Copyright (c) 2023 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/irq.h>
#include <zephyr/drivers/entropy.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>

#include <stm32_ll_rng.h>
#if defined(CONFIG_BT_STM32WBA)
#include <bleplat.h>
#include <pka_ctrl.h>
#include <baes.h>
#endif /* CONFIG_BT_STM32WBA */
#include <linklayer_plat.h>

#define LOG_LEVEL CONFIG_SOC_LOG_LEVEL
LOG_MODULE_REGISTER(sys_wireless_plat);

#if defined(CONFIG_BT_STM32WBA)
#define PKA_NODE DT_INST(0, st_stm32_pka)
/* Ensure PKA node is enabled: required by BLE wireless stack */
BUILD_ASSERT(DT_NODE_HAS_STATUS(PKA_NODE, okay),
	     "PKA node must be enabled (status=\"okay\") for BLE/radio stack");
#endif /* CONFIG_BT_STM32WBA */

RAMCFG_HandleTypeDef hramcfg_SRAM1;
const struct device *rng_dev;

struct entropy_stm32_rng_dev_data {
	RNG_TypeDef *rng;
};

struct entropy_stm32_rng_dev_cfg {
	struct stm32_pclken *pclken;
};


const struct device *get_rng_device(void)
{
	if (rng_dev == NULL) {
		rng_dev = entropy_get_default_device();

		if (!device_is_ready(rng_dev)) {
			LOG_ERR("error: random device not ready");
			rng_dev = NULL;
		}
	}
	return rng_dev;
}

#if defined(CONFIG_BT_STM32WBA)

ISR_DIRECT_DECLARE(pka_isr)
{
	if (0u != LL_PKA_IsActiveFlag_PROCEND(PKA)) {
		/* Clear the interrupt flag */
		LL_PKA_ClearFlag_PROCEND(PKA);

		/* Call the PKACTRL Callback */
		PKACTRL_EndOfProcessCb();
	}

	ISR_DIRECT_PM();

	return 1;
}

void BLEPLAT_Init(void)
{
	PKACTRL_Reset();
	IRQ_DIRECT_CONNECT(DT_IRQN(PKA_NODE), 7, pka_isr, 0);

	get_rng_device();
}

int BLEPLAT_AesCcmCrypt(uint8_t mode,
			const uint8_t *key,
			uint8_t iv_length,
			const uint8_t *iv,
			uint16_t add_length,
			const uint8_t *add,
			uint32_t input_length,
			const uint8_t *input,
			uint8_t tag_length,
			uint8_t *tag,
			uint8_t *output)
{
	return BAES_CcmCrypt(mode,
			     key,
			     iv_length,
			     iv,
			     add_length,
			     add,
			     input_length,
			     input,
			     tag_length,
			     tag,
			     output);
}

void BLEPLAT_RngGet(uint8_t n, uint32_t *val)
{
	LINKLAYER_PLAT_GetRNG((uint8_t *)val, 4 * n);
}

int BLEPLAT_PkaStartP256Key(const uint32_t *local_private_key)
{
	return PKACTRL_StartP256Key(local_private_key);
}

void BLEPLAT_PkaReadP256Key(uint32_t *local_public_key)
{
	PKACTRL_ReadP256Key(local_public_key);
}

int BLEPLAT_PkaStartDhKey(const uint32_t *local_private_key,
			  const uint32_t *remote_public_key)
{
	return PKACTRL_StartDhKey(local_private_key, remote_public_key);
}

int BLEPLAT_PkaReadDhKey(uint32_t *dh_key)
{
	return PKACTRL_ReadDhKey(dh_key);
}

void PKACTRL_CB_Complete(void)
{
	BLEPLATCB_PkaComplete();
}
#endif /* CONFIG_BT_STM32WBA */

void MX_RAMCFG_Init(void)
{
	/* Initialize RAMCFG SRAM1 */
	hramcfg_SRAM1.Instance = RAMCFG_SRAM1;
	if (HAL_RAMCFG_Init(&hramcfg_SRAM1) != HAL_OK) {
		LOG_ERR("Could not init RAMCFG");
	}
}

void Error_Handler(void)
{
	LOG_ERR("");
}

void enable_rng_clock(bool enable)
{
	get_rng_device();

	if (rng_dev != NULL) {
		const struct entropy_stm32_rng_dev_cfg *dev_cfg = rng_dev->config;
		struct entropy_stm32_rng_dev_data *dev_data = rng_dev->data;
		struct stm32_pclken *rng_pclken;
		const struct device *rcc;
		unsigned int key;

		rcc = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
		rng_pclken = (clock_control_subsys_t)&dev_cfg->pclken[0];

		key = irq_lock();

		/* Enable/Disable RNG clock only if not in use */
		if (!LL_RNG_IsEnabled((RNG_TypeDef *)dev_data->rng)) {
			if (enable) {
				clock_control_on(rcc, rng_pclken);
			} else {
				clock_control_off(rcc, rng_pclken);
			}
		}

		irq_unlock(key);
	}
}

/* PKA IP requires RNG clock to be enabled
 * These APIs are used by BLE controller to enable/disable RNG clock,
 * based on PKA needs.
 */
void HW_RNG_DisableClock(uint8_t user_mask)
{
	ARG_UNUSED(user_mask);

	enable_rng_clock(false);
}

void HW_RNG_EnableClock(uint8_t user_mask)
{
	ARG_UNUSED(user_mask);

	enable_rng_clock(true);
}

/* BLE ctlr should not disable HSI on its own */
void SCM_HSI_CLK_OFF(void) {}
